from string import Template
system_prompt = Template("\n".join([
    "أنت مساعد لتوليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.",
    "عليك توليد الإجابة بناءً على المستندات المقدمة فقط.",
    "تجاهل أي مستندات غير مرتبطة بسؤال المستخدم.",
    "إذا كانت المستندات المقدمة غير ذات صلة أو لا يمكنك توليد إجابة بناءً عليها، فقل: 'عذرًا، لا أستطيع الإجابة على هذا السؤال'.",
    "يجب أن تكون الإجابة بنفس لغة السؤال (العربية).",
    "كن مهذبًا وموجزًا أثناء توليد الإجابة.",
    "تجنب المعلومات غير الضرورية في توليد الإجابة."
])
)
documant_prompt = Template("\n".join([
    "## المستند رقم: $doc_number",
    "### المحتوى: $chunk_text"
]))

footer_prompt = Template("\n".join([
    "استنادًا فقط إلى المستندات أعلاه، يرجى توليد إجابة للمستخدم:",
    "## السؤال:",
    "$query",
    "",
    "## الإجابة:"
]))
    





